## plan (dev)

Parameter: none

✓ Plan successfull
✓ Plan summary:

| CHANGE |                                  RESOURCE                                   |
|--------|-----------------------------------------------------------------------------|
| add    | `module.dev_vdi[0].aws_acm_certificate.this`                                |
|        | `module.dev_vdi[0].aws_acm_certificate_validation.this`                     |
|        | `module.dev_vdi[0].aws_eip.this`                                            |
|        | `module.dev_vdi[0].aws_iam_instance_profile.this[0]`                        |
|        | `module.dev_vdi[0].aws_iam_role.this[0]`                                    |
|        | `module.dev_vdi[0].aws_iam_role_policy_attachment.this[0]`                  |
|        | `module.dev_vdi[0].aws_instance.agent[0]`                                   |
|        | `module.dev_vdi[0].aws_instance.agent[1]`                                   |
|        | `module.dev_vdi[0].aws_instance.cpx[0]`                                     |
|        | `module.dev_vdi[0].aws_instance.cpx[1]`                                     |
|        | `module.dev_vdi[0].aws_instance.db`                                         |
|        | `module.dev_vdi[0].aws_instance.webapp[0]`                                  |
|        | `module.dev_vdi[0].aws_instance.webapp[1]`                                  |
|        | `module.dev_vdi[0].aws_internet_gateway.this`                               |
|        | `module.dev_vdi[0].aws_key_pair.ssh_keys`                                   |
|        | `module.dev_vdi[0].aws_lb.private`                                          |
|        | `module.dev_vdi[0].aws_lb.public`                                           |
|        | `module.dev_vdi[0].aws_lb_listener.http`                                    |
|        | `module.dev_vdi[0].aws_lb_listener.https`                                   |
|        | `module.dev_vdi[0].aws_lb_listener.private`                                 |
|        | `module.dev_vdi[0].aws_lb_target_group.private`                             |
|        | `module.dev_vdi[0].aws_lb_target_group.public`                              |
|        | `module.dev_vdi[0].aws_lb_target_group_attachment.private[0]`               |
|        | `module.dev_vdi[0].aws_lb_target_group_attachment.private[1]`               |
|        | `module.dev_vdi[0].aws_lb_target_group_attachment.public[0]`                |
|        | `module.dev_vdi[0].aws_lb_target_group_attachment.public[1]`                |
|        | `module.dev_vdi[0].aws_nat_gateway.this`                                    |
|        | `module.dev_vdi[0].aws_route53_health_check.kasm-elb-hc`                    |
|        | `module.dev_vdi[0].aws_route53_record.private`                              |
|        | `module.dev_vdi[0].aws_route53_record.public`                               |
|        | `module.dev_vdi[0].aws_route53_record.this["*.vdi.dev.ontracon.cloud"]`     |
|        | `module.dev_vdi[0].aws_route53_record.this["vdi.dev.ontracon.cloud"]`       |
|        | `module.dev_vdi[0].aws_route_table.ig`                                      |
|        | `module.dev_vdi[0].aws_route_table.nat`                                     |
|        | `module.dev_vdi[0].aws_route_table_association.agent`                       |
|        | `module.dev_vdi[0].aws_route_table_association.alb[0]`                      |
|        | `module.dev_vdi[0].aws_route_table_association.alb[1]`                      |
|        | `module.dev_vdi[0].aws_route_table_association.cpx[0]`                      |
|        | `module.dev_vdi[0].aws_route_table_association.db`                          |
|        | `module.dev_vdi[0].aws_route_table_association.webapp[0]`                   |
|        | `module.dev_vdi[0].aws_route_table_association.webapp[1]`                   |
|        | `module.dev_vdi[0].aws_route_table_association.windows[0]`                  |
|        | `module.dev_vdi[0].aws_s3_bucket.this`                                      |
|        | `module.dev_vdi[0].aws_s3_bucket_policy.this`                               |
|        | `module.dev_vdi[0].aws_s3_bucket_public_access_block.this`                  |
|        | `module.dev_vdi[0].aws_s3_bucket_server_side_encryption_configuration.this` |
|        | `module.dev_vdi[0].aws_security_group.agent`                                |
|        | `module.dev_vdi[0].aws_security_group.cpx[0]`                               |
|        | `module.dev_vdi[0].aws_security_group.db`                                   |
|        | `module.dev_vdi[0].aws_security_group.private_lb`                           |
|        | `module.dev_vdi[0].aws_security_group.public_lb`                            |
|        | `module.dev_vdi[0].aws_security_group.webapp`                               |
|        | `module.dev_vdi[0].aws_security_group.windows[0]`                           |
|        | `module.dev_vdi[0].aws_security_group_rule.agent["https"]`                  |
|        | `module.dev_vdi[0].aws_security_group_rule.agent_egress["all"]`             |
|        | `module.dev_vdi[0].aws_security_group_rule.cpx["https"]`                    |
|        | `module.dev_vdi[0].aws_security_group_rule.cpx_egress["all"]`               |
|        | `module.dev_vdi[0].aws_security_group_rule.db["postgres"]`                  |
|        | `module.dev_vdi[0].aws_security_group_rule.db["redis"]`                     |
|        | `module.dev_vdi[0].aws_security_group_rule.db_egress["all"]`                |
|        | `module.dev_vdi[0].aws_security_group_rule.private_lb_agent["https"]`       |
|        | `module.dev_vdi[0].aws_security_group_rule.private_lb_cpx[0]`               |
|        | `module.dev_vdi[0].aws_security_group_rule.private_lb_egress["https"]`      |
|        | `module.dev_vdi[0].aws_security_group_rule.private_lb_windows[0]`           |
|        | `module.dev_vdi[0].aws_security_group_rule.public_lb_egress["all"]`         |
|        | `module.dev_vdi[0].aws_security_group_rule.public_lb_ingress["http"]`       |
|        | `module.dev_vdi[0].aws_security_group_rule.public_lb_ingress["https"]`      |
|        | `module.dev_vdi[0].aws_security_group_rule.webapp_agent_ingress`            |
|        | `module.dev_vdi[0].aws_security_group_rule.webapp_cpx[0]`                   |
|        | `module.dev_vdi[0].aws_security_group_rule.webapp_egress["all"]`            |
|        | `module.dev_vdi[0].aws_security_group_rule.webapp_private_lb_ingress`       |
|        | `module.dev_vdi[0].aws_security_group_rule.webapp_public_lb_ingress`        |
|        | `module.dev_vdi[0].aws_security_group_rule.webapp_windows[0]`               |
|        | `module.dev_vdi[0].aws_security_group_rule.windows["cpx_api"]`              |
|        | `module.dev_vdi[0].aws_security_group_rule.windows["cpx_rdp"]`              |
|        | `module.dev_vdi[0].aws_security_group_rule.windows["webapp_api"]`           |
|        | `module.dev_vdi[0].aws_security_group_rule.windows_egress["all"]`           |
|        | `module.dev_vdi[0].aws_subnet.agent`                                        |
|        | `module.dev_vdi[0].aws_subnet.alb[0]`                                       |
|        | `module.dev_vdi[0].aws_subnet.alb[1]`                                       |
|        | `module.dev_vdi[0].aws_subnet.cpx[0]`                                       |
|        | `module.dev_vdi[0].aws_subnet.db`                                           |
|        | `module.dev_vdi[0].aws_subnet.webapp[0]`                                    |
|        | `module.dev_vdi[0].aws_subnet.webapp[1]`                                    |
|        | `module.dev_vdi[0].aws_subnet.windows[0]`                                   |
|        | `module.dev_vdi[0].aws_vpc.this`                                            |
|        | `module.dev_vdi[0].tls_private_key.ssh_key[0]`                              |
✓ Plan Details:

<details>

<summary>Details of tofu plan</summary>

```console


OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.dev_vdi[0].aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "vdi.dev.ontracon.cloud"
      + domain_validation_options = [
          + {
              + domain_name           = "*.vdi.dev.ontracon.cloud"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "vdi.dev.ontracon.cloud"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.vdi.dev.ontracon.cloud",
          + "vdi.dev.ontracon.cloud",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.dev_vdi[0].aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.dev_vdi[0].aws_eip.this will be created
  + resource "aws_eip" "this" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "on-dev-vdi-kasm-nat-gateway-eip"
        }
      + tags_all             = {
          + "Name" = "on-dev-vdi-kasm-nat-gateway-eip"
        }
      + vpc                  = (known after apply)
    }

  # module.dev_vdi[0].aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "Kasm_SSM_Instance_Profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "Kasm_SSM_IAM_Instance_Role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.dev_vdi[0].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "Kasm_SSM_IAM_Instance_Role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.dev_vdi[0].aws_iam_role_policy_attachment.this[0] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "Kasm_SSM_IAM_Instance_Role"
    }

  # module.dev_vdi[0].aws_instance.agent[0] will be created
  + resource "aws_instance" "agent" {
      + ami                                  = "ami-0745b7d4092315796"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "on-dev-vdi-ssh-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"                = "on-dev-vdi-default-kasm-agent-0"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all                             = {
          + "Name"                = "on-dev-vdi-default-kasm-agent-0"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive value)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = (known after apply)
        }
    }

  # module.dev_vdi[0].aws_instance.agent[1] will be created
  + resource "aws_instance" "agent" {
      + ami                                  = "ami-0745b7d4092315796"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "on-dev-vdi-ssh-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"                = "on-dev-vdi-default-kasm-agent-1"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all                             = {
          + "Name"                = "on-dev-vdi-default-kasm-agent-1"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive value)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = (known after apply)
        }
    }

  # module.dev_vdi[0].aws_instance.cpx[0] will be created
  + resource "aws_instance" "cpx" {
      + ami                                  = "ami-0745b7d4092315796"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "on-dev-vdi-ssh-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"                = "on-dev-vdi-default-kasm-cpx-0"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all                             = {
          + "Name"                = "on-dev-vdi-default-kasm-cpx-0"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive value)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = (known after apply)
        }
    }

  # module.dev_vdi[0].aws_instance.cpx[1] will be created
  + resource "aws_instance" "cpx" {
      + ami                                  = "ami-0745b7d4092315796"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "on-dev-vdi-ssh-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"                = "on-dev-vdi-default-kasm-cpx-1"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all                             = {
          + "Name"                = "on-dev-vdi-default-kasm-cpx-1"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive value)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = (known after apply)
        }
    }

  # module.dev_vdi[0].aws_instance.db will be created
  + resource "aws_instance" "db" {
      + ami                                  = "ami-0745b7d4092315796"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "on-dev-vdi-ssh-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"                = "on-dev-vdi-kasm-db"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all                             = {
          + "Name"                = "on-dev-vdi-kasm-db"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive value)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = (known after apply)
        }
    }

  # module.dev_vdi[0].aws_instance.webapp[0] will be created
  + resource "aws_instance" "webapp" {
      + ami                                  = "ami-0745b7d4092315796"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "on-dev-vdi-ssh-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "on-dev-vdi-default-kasm-webapp-0"
        }
      + tags_all                             = {
          + "Name" = "on-dev-vdi-default-kasm-webapp-0"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive value)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = (known after apply)
        }
    }

  # module.dev_vdi[0].aws_instance.webapp[1] will be created
  + resource "aws_instance" "webapp" {
      + ami                                  = "ami-0745b7d4092315796"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "on-dev-vdi-ssh-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "on-dev-vdi-default-kasm-webapp-1"
        }
      + tags_all                             = {
          + "Name" = "on-dev-vdi-default-kasm-webapp-1"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive value)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 50
          + volume_type           = (known after apply)
        }
    }

  # module.dev_vdi[0].aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "on-dev-vdi-kasm-ig"
        }
      + tags_all = {
          + "Name" = "on-dev-vdi-kasm-ig"
        }
      + vpc_id   = (known after apply)
    }

  # module.dev_vdi[0].aws_key_pair.ssh_keys will be created
  + resource "aws_key_pair" "ssh_keys" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "on-dev-vdi-ssh-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags_all        = (known after apply)
    }

  # module.dev_vdi[0].aws_lb.private will be created
  + resource "aws_lb" "private" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "on-dev-vdi-private-lb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name"                = "on-dev-vdi-kasm-private-lb"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all                                                     = {
          + "Name"                = "on-dev-vdi-kasm-private-lb"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
        }
    }

  # module.dev_vdi[0].aws_lb.public will be created
  + resource "aws_lb" "public" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "on-dev-vdi-lb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name" = "on-dev-vdi-kasm-public-lb"
        }
      + tags_all                                                     = {
          + "Name" = "on-dev-vdi-kasm-public-lb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
        }
    }

  # module.dev_vdi[0].aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + load_balancer_arn        = (known after apply)
      + port                     = 80
      + protocol                 = "HTTP"
      + ssl_policy               = (known after apply)
      + tags                     = {
          + "Name"                = "on-dev-vdi-kasm-public-http-listener"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all                 = {
          + "Name"                = "on-dev-vdi-kasm-public-http-listener"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tcp_idle_timeout_seconds = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.dev_vdi[0].aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn                      = (known after apply)
      + certificate_arn          = (known after apply)
      + id                       = (known after apply)
      + load_balancer_arn        = (known after apply)
      + port                     = 443
      + protocol                 = "HTTPS"
      + ssl_policy               = (known after apply)
      + tags                     = {
          + "Name"                = "on-dev-vdi-kasm-public-https-listener"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all                 = {
          + "Name"                = "on-dev-vdi-kasm-public-https-listener"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tcp_idle_timeout_seconds = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.dev_vdi[0].aws_lb_listener.private will be created
  + resource "aws_lb_listener" "private" {
      + arn                      = (known after apply)
      + certificate_arn          = (known after apply)
      + id                       = (known after apply)
      + load_balancer_arn        = (known after apply)
      + port                     = 443
      + protocol                 = "HTTPS"
      + ssl_policy               = (known after apply)
      + tags                     = {
          + "Name"                = "on-dev-vdi-kasm-private-https-listener"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all                 = {
          + "Name"                = "on-dev-vdi-kasm-private-https-listener"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tcp_idle_timeout_seconds = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.dev_vdi[0].aws_lb_target_group.private will be created
  + resource "aws_lb_target_group" "private" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "on-dev-vdi-private-target-group"
      + name_prefix                        = (known after apply)
      + port                               = 443
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTPS"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"                = "on-dev-vdi-kasm-private-tg"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all                           = {
          + "Name"                = "on-dev-vdi-kasm-private-tg"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/api/__healthcheck"
          + port                = "traffic-port"
          + protocol            = "HTTPS"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # module.dev_vdi[0].aws_lb_target_group.public will be created
  + resource "aws_lb_target_group" "public" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "on-dev-vdi-target-group"
      + name_prefix                        = (known after apply)
      + port                               = 443
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTPS"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"                = "on-dev-vdi-kasm-public-tg"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all                           = {
          + "Name"                = "on-dev-vdi-kasm-public-tg"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/api/__healthcheck"
          + port                = "traffic-port"
          + protocol            = "HTTPS"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # module.dev_vdi[0].aws_lb_target_group_attachment.private[0] will be created
  + resource "aws_lb_target_group_attachment" "private" {
      + id               = (known after apply)
      + port             = 443
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # module.dev_vdi[0].aws_lb_target_group_attachment.private[1] will be created
  + resource "aws_lb_target_group_attachment" "private" {
      + id               = (known after apply)
      + port             = 443
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # module.dev_vdi[0].aws_lb_target_group_attachment.public[0] will be created
  + resource "aws_lb_target_group_attachment" "public" {
      + id               = (known after apply)
      + port             = 443
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # module.dev_vdi[0].aws_lb_target_group_attachment.public[1] will be created
  + resource "aws_lb_target_group_attachment" "public" {
      + id               = (known after apply)
      + port             = 443
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # module.dev_vdi[0].aws_nat_gateway.this will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "on-dev-vdi-kasm-nat-gateway"
        }
      + tags_all                           = {
          + "Name" = "on-dev-vdi-kasm-nat-gateway"
        }
    }

  # module.dev_vdi[0].aws_route53_health_check.kasm-elb-hc will be created
  + resource "aws_route53_health_check" "kasm-elb-hc" {
      + arn               = (known after apply)
      + disabled          = false
      + enable_sni        = (known after apply)
      + failure_threshold = 5
      + fqdn              = "vdi.dev.ontracon.cloud"
      + id                = (known after apply)
      + measure_latency   = false
      + port              = 443
      + request_interval  = 30
      + resource_path     = "/api/__healthcheck"
      + tags              = {
          + "Name"                = "hc-vdi.dev.ontracon.cloud"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all          = {
          + "Name"                = "hc-vdi.dev.ontracon.cloud"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + type              = "HTTPS"
    }

  # module.dev_vdi[0].aws_route53_record.private will be created
  + resource "aws_route53_record" "private" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "eu-central-1-private.vdi.dev.ontracon.cloud"
      + type            = "A"
      + zone_id         = "Z060286020XDUFKZKVIBZ"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.dev_vdi[0].aws_route53_record.public will be created
  + resource "aws_route53_record" "public" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "vdi.dev.ontracon.cloud"
      + type            = "A"
      + zone_id         = "Z060286020XDUFKZKVIBZ"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.dev_vdi[0].aws_route53_record.this["*.vdi.dev.ontracon.cloud"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 30
      + type            = (known after apply)
      + zone_id         = "Z060286020XDUFKZKVIBZ"
    }

  # module.dev_vdi[0].aws_route53_record.this["vdi.dev.ontracon.cloud"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 30
      + type            = (known after apply)
      + zone_id         = "Z060286020XDUFKZKVIBZ"
    }

  # module.dev_vdi[0].aws_route_table.ig will be created
  + resource "aws_route_table" "ig" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name"                = "on-dev-vdi-kasm-default-route"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all         = {
          + "Name"                = "on-dev-vdi-kasm-default-route"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + vpc_id           = (known after apply)
    }

  # module.dev_vdi[0].aws_route_table.nat will be created
  + resource "aws_route_table" "nat" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name"                = "on-dev-vdi-kasm-natgw-route"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all         = {
          + "Name"                = "on-dev-vdi-kasm-natgw-route"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + vpc_id           = (known after apply)
    }

  # module.dev_vdi[0].aws_route_table_association.agent will be created
  + resource "aws_route_table_association" "agent" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dev_vdi[0].aws_route_table_association.alb[0] will be created
  + resource "aws_route_table_association" "alb" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dev_vdi[0].aws_route_table_association.alb[1] will be created
  + resource "aws_route_table_association" "alb" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dev_vdi[0].aws_route_table_association.cpx[0] will be created
  + resource "aws_route_table_association" "cpx" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dev_vdi[0].aws_route_table_association.db will be created
  + resource "aws_route_table_association" "db" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dev_vdi[0].aws_route_table_association.webapp[0] will be created
  + resource "aws_route_table_association" "webapp" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dev_vdi[0].aws_route_table_association.webapp[1] will be created
  + resource "aws_route_table_association" "webapp" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dev_vdi[0].aws_route_table_association.windows[0] will be created
  + resource "aws_route_table_association" "windows" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dev_vdi[0].aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "on-dev-vdi-default-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all                    = {
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.dev_vdi[0].aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.dev_vdi[0].aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.dev_vdi[0].aws_s3_bucket_server_side_encryption_configuration.this will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.dev_vdi[0].aws_security_group.agent will be created
  + resource "aws_security_group" "agent" {
      + arn                    = (known after apply)
      + description            = "Allow access to agents"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "on-dev-vdi-kasm-agent-access"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                = "on-dev-vdi-kasm-agent-access"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all               = {
          + "Name"                = "on-dev-vdi-kasm-agent-access"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + vpc_id                 = (known after apply)
    }

  # module.dev_vdi[0].aws_security_group.cpx[0] will be created
  + resource "aws_security_group" "cpx" {
      + arn                    = (known after apply)
      + description            = "Allow access to cpx RDP nodes"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "on-dev-vdi-kasm-cpx-access"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                = "on-dev-vdi-kasm-cpx-access"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all               = {
          + "Name"                = "on-dev-vdi-kasm-cpx-access"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + vpc_id                 = (known after apply)
    }

  # module.dev_vdi[0].aws_security_group.db will be created
  + resource "aws_security_group" "db" {
      + arn                    = (known after apply)
      + description            = "Allow access to webapps"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "on-dev-vdi-kasm-db-access"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                = "on-dev-vdi-kasm-db-access"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all               = {
          + "Name"                = "on-dev-vdi-kasm-db-access"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + vpc_id                 = (known after apply)
    }

  # module.dev_vdi[0].aws_security_group.private_lb will be created
  + resource "aws_security_group" "private_lb" {
      + arn                    = (known after apply)
      + description            = "Security Group for ELB"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "on-dev-vdi-kasm-allow-private-lb-access"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                = "on-dev-vdi-kasm-private-lb-access"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all               = {
          + "Name"                = "on-dev-vdi-kasm-private-lb-access"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + vpc_id                 = (known after apply)
    }

  # module.dev_vdi[0].aws_security_group.public_lb will be created
  + resource "aws_security_group" "public_lb" {
      + arn                    = (known after apply)
      + description            = "Security Group for ELB"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "on-dev-vdi-kasm-allow-public-lb-access"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                = "on-dev-vdi-kasm-public-lb-access"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all               = {
          + "Name"                = "on-dev-vdi-kasm-public-lb-access"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + vpc_id                 = (known after apply)
    }

  # module.dev_vdi[0].aws_security_group.webapp will be created
  + resource "aws_security_group" "webapp" {
      + arn                    = (known after apply)
      + description            = "Allow access to webapps"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "on-dev-vdi-kasm-webapp"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                = "on-dev-vdi-kasm-webapp-access"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all               = {
          + "Name"                = "on-dev-vdi-kasm-webapp-access"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + vpc_id                 = (known after apply)
    }

  # module.dev_vdi[0].aws_security_group.windows[0] will be created
  + resource "aws_security_group" "windows" {
      + arn                    = (known after apply)
      + description            = "Allow access to Windows servers"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "on-dev-vdi-kasm-windows-access"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                = "on-dev-vdi-kasm-windows-access"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all               = {
          + "Name"                = "on-dev-vdi-kasm-windows-access"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + vpc_id                 = (known after apply)
    }

  # module.dev_vdi[0].aws_security_group_rule.agent["https"] will be created
  + resource "aws_security_group_rule" "agent" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.dev_vdi[0].aws_security_group_rule.agent_egress["all"] will be created
  + resource "aws_security_group_rule" "agent_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.dev_vdi[0].aws_security_group_rule.cpx["https"] will be created
  + resource "aws_security_group_rule" "cpx" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.dev_vdi[0].aws_security_group_rule.cpx_egress["all"] will be created
  + resource "aws_security_group_rule" "cpx_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.dev_vdi[0].aws_security_group_rule.db["postgres"] will be created
  + resource "aws_security_group_rule" "db" {
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.dev_vdi[0].aws_security_group_rule.db["redis"] will be created
  + resource "aws_security_group_rule" "db" {
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6379
      + type                     = "ingress"
    }

  # module.dev_vdi[0].aws_security_group_rule.db_egress["all"] will be created
  + resource "aws_security_group_rule" "db_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.dev_vdi[0].aws_security_group_rule.private_lb_agent["https"] will be created
  + resource "aws_security_group_rule" "private_lb_agent" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.dev_vdi[0].aws_security_group_rule.private_lb_cpx[0] will be created
  + resource "aws_security_group_rule" "private_lb_cpx" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.dev_vdi[0].aws_security_group_rule.private_lb_egress["https"] will be created
  + resource "aws_security_group_rule" "private_lb_egress" {
      + cidr_blocks              = [
          + "10.0.2.0/24",
          + "10.0.3.0/24",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.dev_vdi[0].aws_security_group_rule.private_lb_windows[0] will be created
  + resource "aws_security_group_rule" "private_lb_windows" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.dev_vdi[0].aws_security_group_rule.public_lb_egress["all"] will be created
  + resource "aws_security_group_rule" "public_lb_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.dev_vdi[0].aws_security_group_rule.public_lb_ingress["http"] will be created
  + resource "aws_security_group_rule" "public_lb_ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.dev_vdi[0].aws_security_group_rule.public_lb_ingress["https"] will be created
  + resource "aws_security_group_rule" "public_lb_ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.dev_vdi[0].aws_security_group_rule.webapp_agent_ingress will be created
  + resource "aws_security_group_rule" "webapp_agent_ingress" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.dev_vdi[0].aws_security_group_rule.webapp_cpx[0] will be created
  + resource "aws_security_group_rule" "webapp_cpx" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.dev_vdi[0].aws_security_group_rule.webapp_egress["all"] will be created
  + resource "aws_security_group_rule" "webapp_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.dev_vdi[0].aws_security_group_rule.webapp_private_lb_ingress will be created
  + resource "aws_security_group_rule" "webapp_private_lb_ingress" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.dev_vdi[0].aws_security_group_rule.webapp_public_lb_ingress will be created
  + resource "aws_security_group_rule" "webapp_public_lb_ingress" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.dev_vdi[0].aws_security_group_rule.webapp_windows[0] will be created
  + resource "aws_security_group_rule" "webapp_windows" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.dev_vdi[0].aws_security_group_rule.windows["cpx_api"] will be created
  + resource "aws_security_group_rule" "windows" {
      + from_port                = 4902
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4902
      + type                     = "ingress"
    }

  # module.dev_vdi[0].aws_security_group_rule.windows["cpx_rdp"] will be created
  + resource "aws_security_group_rule" "windows" {
      + from_port                = 3389
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3389
      + type                     = "ingress"
    }

  # module.dev_vdi[0].aws_security_group_rule.windows["webapp_api"] will be created
  + resource "aws_security_group_rule" "windows" {
      + from_port                = 4902
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4902
      + type                     = "ingress"
    }

  # module.dev_vdi[0].aws_security_group_rule.windows_egress["all"] will be created
  + resource "aws_security_group_rule" "windows_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.dev_vdi[0].aws_subnet.agent will be created
  + resource "aws_subnet" "agent" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "on-dev-vdi-agent-subnet"
        }
      + tags_all                                       = {
          + "Name" = "on-dev-vdi-agent-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.dev_vdi[0].aws_subnet.alb[0] will be created
  + resource "aws_subnet" "alb" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "on-dev-vdi-kasm-lb-subnet-0"
        }
      + tags_all                                       = {
          + "Name" = "on-dev-vdi-kasm-lb-subnet-0"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.dev_vdi[0].aws_subnet.alb[1] will be created
  + resource "aws_subnet" "alb" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "on-dev-vdi-kasm-lb-subnet-1"
        }
      + tags_all                                       = {
          + "Name" = "on-dev-vdi-kasm-lb-subnet-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.dev_vdi[0].aws_subnet.cpx[0] will be created
  + resource "aws_subnet" "cpx" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                = "on-dev-vdi-cpx-subnet"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all                                       = {
          + "Name"                = "on-dev-vdi-cpx-subnet"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.dev_vdi[0].aws_subnet.db will be created
  + resource "aws_subnet" "db" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "on-dev-vdi-kasm-db-subnet"
        }
      + tags_all                                       = {
          + "Name" = "on-dev-vdi-kasm-db-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.dev_vdi[0].aws_subnet.webapp[0] will be created
  + resource "aws_subnet" "webapp" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "on-dev-vdi-kasm-webapp-subnet-0"
        }
      + tags_all                                       = {
          + "Name" = "on-dev-vdi-kasm-webapp-subnet-0"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.dev_vdi[0].aws_subnet.webapp[1] will be created
  + resource "aws_subnet" "webapp" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "on-dev-vdi-kasm-webapp-subnet-1"
        }
      + tags_all                                       = {
          + "Name" = "on-dev-vdi-kasm-webapp-subnet-1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.dev_vdi[0].aws_subnet.windows[0] will be created
  + resource "aws_subnet" "windows" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.7.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                = "on-dev-vdi-windows-subnet"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + tags_all                                       = {
          + "Name"                = "on-dev-vdi-windows-subnet"
          + "OPS:Environment"     = "DEV"
          + "OPS:Source"          = "otc-code/blue-aws-kasm-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.dev_vdi[0].aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "on-dev-vdi-kasm-vpc"
        }
      + tags_all                             = {
          + "Name" = "on-dev-vdi-kasm-vpc"
        }
    }

  # module.dev_vdi[0].tls_private_key.ssh_key[0] will be created
  + resource "tls_private_key" "ssh_key" {
      + algorithm                     = "ED25519"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 87 to add, 0 to change, 0 to destroy.
```
</details>


✓ tofu plan: 87 to add, 0 to change, 0 to destroy.
